[{"title": "Fake Saint Of The Year", "description": "Fudou Niito, a resident of Japan, went to bed dissatisfied with the ending of the game. When he next awoke, he found himself in the body of the game’s hated fake saint, Elrise. Confused, but with an understanding that Elrise’s actions would spell disaster for many lives in the future, he took advantage of the situation and acted to change the course of history.  As a result, despite her rotten personality, Elrise was adored by those around her as a perfect saint. Furthermore, the game itself was intrinsically linked to his original world and changed accordingly to suit Elrise’s actions. Without any knowledge of what the hell was going on, the fake saint Elrise continued to alter her fate. A saint on the outside, but a man on the inside.  The transmigrator was a piece of sh*t and the person he transmigrated into was also a piece of shit. A combination of sh*t and sh*t would cause an accident – to create the greatest fake saint sh*tshow of the year!", "releases": ["//www.novelupdates.com/extnu/6695580/", "//www.novelupdates.com/extnu/6599128/", "//www.novelupdates.com/extnu/6343075/", "//www.novelupdates.com/extnu/6292562/", "//www.novelupdates.com/extnu/6022635/", "//www.novelupdates.com/extnu/6000615/", "//www.novelupdates.com/extnu/5649451/", "//www.novelupdates.com/extnu/6752487/", "//www.novelupdates.com/extnu/5649430/", "//www.novelupdates.com/extnu/6752486/", "//www.novelupdates.com/extnu/5630302/", "//www.novelupdates.com/extnu/6752485/", "//www.novelupdates.com/extnu/5600755/", "//www.novelupdates.com/extnu/6752484/", "//www.novelupdates.com/extnu/5600754/"], "reviews": ["The novel is amazing. The author seemed to have a clear view when writing this story; he set up many things to be explained and explained them all. Not only that, but the character development was fairly good too!", "Definitely overrated, but it isn't bad either. A solid 4/5 for me.\nIt does have some interesting points, and try to tackle aspects that very few similar stories would even mention. It does have its fair share of issues though.\nFirst, the MC is dumb. At least he/she is self-aware of being dumb, but that still gets annoying. Author thinks the reader is dumb too, apparently, and tend to overexplain basic stuff as well as repeat it again and again as if afraid reader would already have forgotten about it. Well, other... more>> characters tend to be dumb too, except a few rare exceptions, so he/she doesn't seem ret*rded by comparison, but still.\nSecond, the \"point of view section\". Outside of the protagonist point of view, the author also liked to have chapters from other point of view to show how other people think and better showcase the misunderstanding. However, while the first few are fun, it becomes clear at some point the author doesn't really understand why \"Point of view from other character\" is used in good litterature. Not going to do a whole essay on what is good point of view, but just going to say that repeating the exact same scene in different point of view is unusual and only to be done if there is substantial added value in basically having a copy paste of the same scene but from different perspective. It's ok the first few times in this novel because it is supposed to showcase the misunderstanding, but it quickly devolves into PoV for the sake of padding out the word count instead of PoV for the sake of fleshing out.\nThird, is the relationship between the MC and Vernell. Or, in a broader sense, the sexual orientation of the protagonist. The whole thing was just awkward. It's like the author really wanted to do a Elrise x Vernell, but was too afraid that it might be perceived badly by the readers. Author constantly makes MC think stuff like \"I'm not homo!\" as well as perv on girl (only in his mind though, no actual action taken) as if to say \"calm down reader, my MC is pure straight, no ambiguous homo relationship\", yet at the same time keep on pushing Elrise x Vernell, without ever really taking the final step. The fact Elrise (MC) doesn't even notice she is basically leading Vernell on and making him fall in love with him/her is either part of her dumb character (see point 1) or part of a repressed sexuality. Overall, the author either is in denial or too afraid to actuallly go through his own ideas so instead just do it in a half-baked way. It's no coincidence that this story was translated by a group that mostly do BL (it's not a criticism; just another way to show the author BL intent really show yet he doesn't really pull through).\nThose are my main negatives, though I can go on a bit and talk about more common aspects.\nWorld-building wise, it definitely is poor. There isn't a lot to say about it, but then again the author doesn't give us a lot to work with. You get to know stuff on a need-to-know basis, centered on the Saint/Witch main plot point. Not a big issue though. What is an issue is when the author notices he hasn't anything else to say for the chapter but didn't reach the word count yet so add in some random world lore dump that doesn't matter at all to the story, will never be brought up again, and is just here to pad the chapter.\nCharacter-wise, it's a mixed bag. You have the MC and Vernell. Then you have the others. The others being a mess of 1D character that exist for a single purpose and not much else. It's interesting how the \"heroines\" are mostly ignored in favor of Vernell. Especially Eterna, considering the MC main objective is supposed to be her happiness, yet she is almost never mentioned, barely has any screen time, and has near zero development. Sometimes, it really feels like most characters only exist so they can be saved by and praise the greatest saint of all times, Elrise.\nWriting-style wise, it's either you like it or you hate it, I guess. Some extract from chapter 2:\n\n\nSpoiler\n\n\nМу tеасhеrѕ аnd а fеw оthеrѕ аѕkеd mе, “Whу dо уоu wоrk ѕо hаrd? Таkіng саrе оf уоurѕеlf іѕ gооd еnоugh.” І dіdn’t wаnt tо аnѕwеr hоnеѕtlу, ѕо І јuѕt ѕаіd hаlf-hеаrtеdlу, “Wеll, І uѕеd tо bе tеrrіblе іn thе раѕt. І’m trуіng tо mаkе uр fоr thаt аnd lіvе uр tо еvеrуоnе’ѕ ехресtаtіоnѕ. І’vе аlrеаdу lоvеd mуѕеlf еnоugh, ѕо nоw І’m gоіng tо lоvе уоu guуѕ. (fіѕt рumр!) ”\nТhе tеасhеrѕ wеrе mоvеd tо tеаrѕ. LОL.\n[...]\nWеll, whеn І dо ѕuсh а thіng, оf соurѕе, І wаѕ аѕkеd, “Whу аrе уоu dоіng nоthіng but thіѕ?” І rерlіеd реrfunсtоrіlу, “І аm vеrу ѕаd, but І’m dоіng іt tо рrоtесt еvеrуоnе’ѕ wеlfаrе (fіѕt рumр).”\nТhеу wеrе mоvеd tо tеаrѕ. LОL.\n[...]\nТhаt’ѕ whу... уер! Rесоvеrу mаgіс, gо! Ваbу, fаll іn lоvе wіth mе.\nWеll, whеn І dо ѕuсh а thіng, оf соurѕе, І wаѕ аѕkеd, “Whу аrе уоu dоіng thіѕ?” І rерlіеd hаlf-hеаrtеdlу, “Аt lеаѕt, І wаnt tо ѕаvе whоmѕоеvеr І саn. Аh, thе рrісе іѕ уоur ѕmіlе рlеаѕе (fіѕt рumр).”\nWеll, іn оthеr wоrdѕ, І’m аbаndоnіng thе оnеѕ І саn’t hеlр.\nІ’m nоt Іndіаn. І саn’t ѕtrеtсh mу hаndѕ whіlе ѕауіng nаmаѕtе.\nЅhе wаѕ mоvеd tо tеаrѕ. LОL.\n[collapse]\n\n\n\nIf any of that put you off as far as writing style go, stay away. It's actually pretty mild and gets even more \"casual\" as it goes. <<less", "The tags for this novel are extremely deceptive, this is at least 10 times better than I ever hoped it would be.\nIt got to the point where I had to dabble in the dark arts of MTL to know how the story would proceed.\nThe plot is surprisingly well done, our MC here is a self proclaimed NEET (male) that got transmigrated into the body of the fake saint Elrise (female) a minor villain of a gal game. She strives for the \"ideal ending\" as usual in this kind of story... more>> but as the plot progresses we are made to realize that things are not as simple as they seem.\nThis is fundamentally a misunderstanding comedy but it's different from the likes of \"Overlord\" or \"To be a Power in the Shadows\" for example because the MC here is counsciously deceiving other people most of the time, she is an extremely selfcentered person, a sociopath if you want and I'm a sucker for this kind of characters when they are done well and Elrise is pulled off reasonably well.\nThis isn't a masterpiece by any means but for a webnovel, especially one of this genre, this is far ahead of anything similar I've come across, the novel is also translated pretty well and, if you want to MTL that's also readable.\nI can only suggest you pretend the tags don't exist (especially the \"romantic subplot\" ones, as they are a stretch) and give it a shot. <<less", "So, if you'll notice, all the reviews saying bad things only read ten to twenty chapters. All the reviews saying good things have completed it or at least went past twenty chapters. This is not a coincidence.\nAt first, the world building seems clumsy, the characters seem cheap, the misunderstandings seem obvious, and the MC seems a little s*upid, changing things and expecting things to go the same. The MC also seems extremely selfish and uncaring of the people around them. Also, the reincarnation explanation (or lack thereof) was complained about.... more>> BUT. If you continue reading, \n\n\nSpoiler\n\n\nthe world around the protagonist is explained more clearly. The MC's cause for their thought process is elaborated on, and you begin to realize that maybe his original personality really is a bit saint-like, and though he degrades himself and has trouble being genuinely considerate of others, he does want to be better. As for as the reincarnation explanation? I thought I learned about the truth of it a few chapters ago, but it seems I may be in the middle of being hit with a double whammy reincarnation explanation/world building exposition that might be quite unique! I'm looking forward to it!\n[collapse]\n\n\n\nAnyway, what I'm saying is, don't judge the story by the first few chapters, as it just gets better and better as it goes on. Even tr*sh of the Count's Family had us misunderstanding our beloved protagonist for ages. Go in with the mind that this protagonist is not as bad as he seems, and that he's an unreliable narrator, just like Cale Henituse. He's seriously growing on me. <<less", "Great novel. Unlike many JP novels, this story sets out with a clear idea of where it wants to end. Some might see 'only' having 85 chapters as being a downside but I much prefer this story where this any annoying fluff and filler. Every chapter move the story forward. I was very satisfied with the end.\nI am also a sucker for characters like Elrise, and I fell in love with her instantly. Other characters could have been more interesting if developed differently, but that is forgivable. The story is... more>> also pretty light hearted so the story is as tense as it could be.\nWhile I wouldn't call the writing a masterpiece, this was one of a handful of stories that I have actually loved all the way though this year. I would definitely recommend giving this a try. <<less", "One of the best damn novels I've read in a while; The MC is relatable and seems like a real person more than many mc's I've read about so far. She honestly might be a psychopath all through out the story up until she fights the [witch], but somehow her realization of this makes her seem more real. She understands her mortality and has good reasons to act without much care to her own personal well being, but it doesn't come off as forced.\nAt the end, I was hoping... more>> for really any romantic development, but wholesome slice of life is good too. <<less", "This is Amazing!!\nA perfect gender bender with misunderstandings, if you are like me, crazy for these two tag you should just read the novel, don t read the review, those are base on different tastes. (Not maniac like us!:D) \nJust read the novel!!!\nYou Will NOT REGRET !!!!", "I'm actually hooked that I finished this at one sitting.\n\n\nSpoiler\n\n\nThe world building for a galge is quite good to be fair, the author has done the plot a good conclusion even without a romantic end which is nice considering that I want her to be as pure till the end. (lol) \n[collapse]\n\n\n\nEdit:\nSeems like it will go like bakarina LN which will extend after the dating sims ended (or not, just added side stories). I'm quite hyped for the continuation!\n\nEdit 2:\nHoo boy the After-story has quite a bittersweet taste onto it... Kinda hope it's got deeper really (or is it just me that doesn't want to end that part, it's really interesting to have a reverse isekai part for some reason as it's rarely used genre.)", "Waiting for ch. 2, the story start getting interesting there.\nMisunderstanding accelerated.\nWhat protag doing in the game? World affect (change?) the game contents in the real world side. And here we got interesting players side reaction.", "One word, masterpiece.\nOkay, that might seem like a exaggeration but this novel really is a very beautiful one. It has very good comedy, very nice plot and a huge feels trip. I\nThe characters are all nice and realistic upto a degree. The MC is just awesome as well.... more>>\nThe world building is excellent specially its history.\nThe plot is pretty good too and will make you laugh and cry at the same time. Some things might confuse you at first, but as you keep reading, you will find that almost everything is explained properly.\nHope it will give you as much enjoyment as it gave me. <<less", "I did not expect this novel to be as good as it was. There were almost no loose ends, and for once, the epilogue chapters were unbelievably satisfying. It's like the author knew exactly how to make the ending into one that doesn't leave you feeling empty. Easily one of my favorite novels now.\n\nEdit: I was wrong I feel so empty now", "Spoiler\n\n\nAs other reviewers who read about 1/4 of the novel say: early chapters can be annoying to read. But once you can get past that, you can experience a great joy as I say below\n[collapse]\n\n\n\nRarely do I read such story so mysterious right at the start that ends with explaining everything leaving no plot holes. It amazes me how well thought out the world building was, as well as how the mystery and twists were handled.\nIt's a story you'd want to continue reading forever but of course, it just ended.\nDefinitely would recommend.", "What the heck, this is absolutely amazing\nA lot of reincarnation stories rely on recreating the original story and thus they'd be able to say obtain cheat items and whatnot, or they use modern knowledge to improve their standing. There's also the usual bullsh*t of \"Ducal family\" and whatnot.\nThis story uses some of those\nIs that bad? Actually no, the author managed to make Elrise's life exciting. This is done by clever use of dual POV: we get to see how Elrise do things, and then we see how things unfold from... more>> outside perspective. Since Elrise by nature needs to keep up appearances, her words and actions easily get misinterpreted, and miraculously the author managed to build the world in a way that makes sense. A lot of stories rely on deus ex machina, but this novel doesn't really make use of that: everything gets explained in consistent manner which is much more important than \"believable\".\nAnother beauty of this series is it doesn't overstay itself: characters that don't need to stay simply gets pushed away, the story also concludes in a very satisfying manner that doesn't seem dragged out, it ends when you think it really should end. The cast are also entertaining with clear, consistent thought process and you can see where they're coming from.\nThe story is also captivating, I always want to see what's coming. While it's true that the protagonist is OP, this is actually beautifully handled: everyone embraced the fact that she's the most powerful person to have ever existed, and with that they also understand the consequences of her powers. This is a source of conflict later on that actually has layers in it which is incredible considering how short that story arc is and is actually one of the cornerstones of the main story.\nAmazingly, unlike in other series where being OP is just a deus ex machina for \"we'll finish this problem\" and therefore needs equally ludicrous issues to hold the OP powers back (looking at you, Kryptonite), her powers are limited due to social constraints, with various people trying to protect the protagonist obviously don't need to be protected, thus preventing her from attacking lest the blast causes collateral damage, because she needs to save face. This is akin to Superman always trying to lure the bad guy to some deserted areas, but executed well.\nThere are many novels that get 5 star from me simply because there's no 4.5 star, or simply because I find it entertaining despite the flaws. This is one of the rare novels that I truly believe deserves 5 stars, simply because I can't find any complaint about it <<less", "This is good, it made me tear up 2 times. The plot holes in the early parts are explained later but I guess it is hard to understand it little. The MC has an unreliable narration, what he does is different from what he says inside his head. The MC is really a saint from the POV of the others. The misunderstanding is a little repetitive but that's bearable. Don't worry about it being gay because there's no romance with the MC at all. Don't be bothered with the POV... more>> of the MC at the start of the story because it's the unreliable narration part, the POV of the other characters towards the MC is more reliable to know what she does and what she says on the outside, but the MC POV is on purpose. Anyway it's really good and I think you should read it <<less", "Amazing. This novel had many plot hole at the start but at the end many plot been hole been filled that I can't help feel amazing. Especially I like that MC power is not an blessings or cheat but more an cursed if been normal or amazing human. Only because MC had broken personality that it became her power.", ">The MC is genderbended from male into female\n>Is really OP\n>People almost align him/herself as a god.... more>>\nYeah, sounds alright, but there must be other novels that already explored that premise right?\nSo what make this different?\nFirstly, the story is really funny with the uses of misunderstanding, to be more specific, the way people interpret his/her action that make them even more delusional that the MC is giga-ultra-extremely awesome.\nSecondly, the MC is actually awesome. He/she is the true selfless saint abeit he/she is fake. People are no fool, they know what the saint is based on action value, not face value. The MC actually helped a lot of people, in the name of \"playing to kill boredom\" in his/her word. The only sin he/she has, it disregarding his/her own well-being.\nThirdly, it has proper drama, suspension although the MC is already OP. Almost nothing can get in his/her way but in the end absolute power isn't really the answer to everything, even death.\nFourthly, the casts are good, they have proper development and their chance to shine, although they are still not fleshed out and still ultimately being supporting role for the MC's story, it isn't really bad. After all, the story never drag too long, so it isn't entirely necessary to explore all the character depts.\nFinally, it is a rollercoaster of emotions. You will be sad, and you will feel pity, ultimately, you will feel happy. That is what the story will offer, and you will be satisfied.\nThat's all my point of how this novel is different and why you should read it. <<less", "To be honest, this is my first review, so don't expect too much.\nI will make it short\n\nI thought it would be just a normal lighthearted story (and it is), but it has more depth than I expected, the explanation and plots are amazing, and the connection character and development are masterpieces, I don't want to spoil too much so I'll leave it here.\nBut I assure you that you will not be sorry if you read this story.", "This story is a masterpiece. Maybe it fits perfectly into my tastes, but this story hid so much more depth than I could have imagined. I don't want to spoil anything, all I will say is I'm disappointed it took me this long to discover it. Author and translation team, thank you so much for the great work.", "It is a really good novel. The protagonist is likeable and funny. And the story is always progressing, without making it feeling rushed.\nRecommended for those who seek comedy gender bender trope.", "My gosh, this novel is so unique and funny. While no harem was a plus for me, I thought the no romance (besides some side cp in extras) would be a downer. But nope! Surprisingly, the gender bender of this very weird guy, our MC, carried this novel from start to finish. Honestly, MC should get an Oscar for his acting skills lol! He saw that he looked like a cute, angelic girl so he acted like a saint. Who would’ve known she (he) was a fake saint that would... more>> become the strongest and most saint-like existence out of all the world’s other saints haha.\nGreat comedy and great ending. A lot of the mysteries presented throughout the novel eventually gets revealed and explained. Definitely a fun read I would recommend, and the extras were satisfying too. <<less", "Saw this randomly popping up, and oh man you're never going to regret picking this up.\nAt first, I thought this is just yet another generic isekai, and the first few chapters do make me think so. However, after the first few chapters, everything start unfolding. No filler, no bullcrap, every chapter filled with plots and can you believe it? An isekai with PROPER MYSTERY, and a damn good one at that.\nReading a chapter just makes me want to read the next one immediately, it makes you want to binge it... more>> as much as possible. Even as an isekai, I can safely say this is one of the best series I had ever read. The pacing is really really good. Jam-packed with actions and plot but not fast to the point of overwhelming.\nYou know what's the most surprising? This story actually managed to make me get attached to the MC unlike every single other isekai. The plot is so unbelievably good that you actually get worried about the MC.\n\n\nSpoiler\n\n\nRight now, at c41 in the story, the MC is currently in an inescapable death countdown that's impossible to survive and it'll go off in less than an year. Even if our MC manages to kill the witch, it'll still require her to end her life to break the cycle.\n[collapse]\n\n\n\nThere aren't much chapters and each chapter are jam-packed with plot and action, so please don't go in expecting a lot of world-building, slice of life and character development (except for MC and the characters that are particularly close to the MC) \ntl;dr: just like what the rating of this series imply, this series is truly fantastic even while being an isekai. Action packed, no filler, no bullcrap. <<less", "It's a fun adventure with a guy that ships the MC and heroine so much that he commits mass genocide on their enemies so they would be free to romance each other only to break the story by becoming the main heroine. I highly recommend it"]}]